app/controllers/game_controller.rb

  def guess
    image = Image.find(params[:image_id])
    guessed_country = params[:guessed_country]&.strip&.downcase

    if guessed_country.blank?
      render json: { message: '⏳ Temps écoulé ! Vous avez perdu.', correct: false }
      return
    end

    correct = image.country.downcase == guessed_country

    if correct
      current_user.update(score: (current_user.score || 0) + 10)
---
SELECT "images".* FROM "images" WHERE "images"."id" = 6 LIMIT 1
SELECT COUNT(*) FROM "images"
SELECT "images".* FROM "images" ORDER BY RANDOM() LIMIT 1
UPDATE "users" SET "score" = 40, "updated_at" = '2025-03-24 11:34:28.957884' WHERE "users"."id" = 5

  def ranking
    @players = User.order(score: :desc).limit(10) # 🔥 Classement des 10 meilleurs joueurs
---
SELECT "users".* FROM "users" ORDER BY "users"."score" DESC LIMIT 10

  def next_image
    if session[:seen_images].size >= Image.count
---
SELECT COUNT(*) FROM "images"

  def next_unique_image
    session[:seen_images] ||= [] # Initialise la session si vide
    available_images = Image.where.not(id: session[:seen_images]) # Récupère les images non encore vues

    if available_images.empty?
      session[:seen_images] = [] # Réinitialise la liste si toutes les images ont été vues
      available_images = Image.all
---
SELECT "images".* FROM "images" WHERE 1=1
SELECT "images".* FROM "images"
SELECT 1 AS one FROM "images" WHERE 1=1 LIMIT 1